[
    {
        "pk": 1,
        "model": "team.Basketball",
        "fields": {
            "name": "James, Joel",
            "first": "Joel James",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/OL/OLPTEGCLTOYLPKB.20120829180406.jpg",
            "twitter": "TheRealJoel0",
            "number": "0",
            "position": "Forward",
            "height": "6-10",
            "weight": "260",
            "year": "Freshman",
            "hometown": "West Palm Beach, Fla.",
            "school": "Dwyer",
            "major": "Undeclared",
            "about": "Played for coach Fred Ross at William T. Dwyer High School in Palm Beach Gardens, Fla. Averaged 15 points, 12.5 rebounds and 2.3 blocked shots per game and shot 63 percent from the floor as a senior. Played in the All-American Championship post-season all-star game in New Orleans. Attended the U.S. U-18 national team training camp in Colorado Springs in June 2012. Won a state championship as a junior. Did not play organized basketball until his sophomore year",
            "personal":" Joel Njonjo James is the son of Cassandra Brown Born on Jan. 22, 1994, in West Palm Beach, Fla. Has yet to declare a major. ",
            "youtube": "hO5S075V3fE"
            
            
        }
    },
    
    {
        "pk": 2,
        "model": "team.Basketball",
        "fields": {
            "name": "Strickland, Dexter",
            "first": "Dexter Strickland",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/QW/QWEMKTTTVFYZDRF.20120829180406.jpg",
            "twitter": "DStrick01",
            "number": "1",
            "position": "Guard",
            "height": "6-3",
            "weight": "180",
            "year": "Senior",
            "hometown": "Rahway, N.J.",
            "school": "St. Patrick",
            "major": "Communication Studies",
            "about": "Medically cleared to resume all basketball activities on August 27, 2012, after undergoing surgery on his right anterior cruciate ligament in February. Has started 59 of 92 games. Scored 617 points (6.7 per game) and has 192 assists. Has played at both guard slots in his career primarily at the point as a freshman and the two-guard as the start of his sophomore season, but began to see more action at the point in the last 16 games in 2010-11. Started his junior year at the off-guard spot but played about six to eight minutes a game as the primary ball handler. Has scored in double figures 22 times (six times in 2011-12) with a career-high 19 against William and Mary in Dec. 2010.",
            "personal":" Son of Dexter L. and Sheronne Strickland. Born Dexter Terrez Strickland on Oct. 1, 1990, in Newark, N.J. Majoring in communication studies.",
            "youtube": "KNPip9ENY98"
            
            
        }
    },
    
    {
        "pk": 3,
        "model": "team.Basketball",
        "fields": {
            "name": "McDonald, Leslie",
            "first": "Leslie McDonald",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/SF/SFPHRVMNAPVRNOV.20120829180406.jpg",
            "twitter": "Lezz_McDonald2",
            "number": "2",
            "position": "Guard",
            "height": "6-5",
            "weight": "215",
            "year": "Junior",
            "hometown": "Memphis, Tenn.",
            "school": "Briarcrest Christian School",
            "major": "Communication Studies",
            "about": "Missed last season after knee surgery. Medically cleared to resume playing after the conclusion of the 2011-12 season. Has played in 70 career games and scored 366 points. Has 62 career three-pointers, most among returning players. Made 40 more three-pointers as a sophomore than he did as a freshman.",
            "personal":" Born Leslie Vernard McDonald on Feb. 4, 1991, in Memphis. Son of Leslie Sr. and Wanda McDonald. Majoring in communication studies.",
            "youtube": "vH9UUXDgZk4"
            
        }
    },
    
    {
        "pk": 4,
        "model": "team.Basketball",
        "fields": {
            "name": "Moody, Wade",
            "first": "Wade Moody",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/ZQ/ZQKLSWRJBJFXBGL.20121030160827.jpg",
            "twitter": "wademoody3",
            "number": "3",
            "position": "Guard",
            "height": "6-0",
            "weight": "175",
            "year": "Junior",
            "hometown": "Mount Airy, N.C.",
            "school": "Mount Airy",
            "major": "Management and Society",
            "about": "A walk-on who joined the varsity team in October 2012. A veteran of the UNC junior varsity program. Played JV ball as a sophomore. Played three years of varsity basketball at Mount Airy High School and twice earned all-conference honors under Coach Kevin Spainhour. Averaged 12 points and four assists per game for his career, including 20 ppg as a senior. Led Mount Airy to two conference championships. Also played a year of varsity baseball. Member of the National Honor Society and the Vocational Honor Society. Also involved in Young Life. Senior class president.",
            "personal":"Robert Wade Moody is the son of Bob and Kathy Moody. Born on September 6, 1991, in Mount Airy, N.C. Majoring in Management and Society.",
            "youtube": "gc7LeoETNH0"
            
        }
    },
    
    {
        "pk": 5,
        "model": "team.Basketball",
        "fields": {
            "name": "Davis, Luke",
            "first": "Luke Davis",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/HG/HGAPQXZWZIUPPAR.20120829180405.jpg",
            "twitter": "Luke_Davis4",
            "number": "4",
            "position": "Guard",
            "height": "6-0",
            "weight": "172",
            "year": "Sophomore",
            "hometown": "Raleigh, N.C.",
            "school": "Ravenscroft",
            "major": "Sociology",
            "about": "Transferred to UNC from Gardner-Webb after playing for the Bulldogs in 2010-11. Sat out the 2011-12 season as a redshirt at Carolina. Has three seasons of eligibility beginning in 2012-13. AT GARDNER-WEBB: Named to the Big South Conference All-Freshman Team. Was third in the league in assists. Started 30 of the 32 games in which he played for Gardner-Webb and played a team-high 32.3 minutes per game. Averaged 7.2 points, had 135 assists and 95 turnovers. Made 41 of 126 (.325) from three-point range and 46 of 62 (.742) from the free throw line. Scored in double figures six times with a high of 17 against Liberty. Had a season-high 10 assists against Radford. Had more assists than turnovers in 18 games, including 10 of the last 13 games. Set a freshman record for assists at Gardner-Webb with 135.",
            "personal":"Luke Dickson Davis is the son of Pete and Debbie Davis. Born on April 9, 1991, in Raleigh, N.C. Majoring in sociology.",
            "youtube": "5nL7u8UADcU"
            
        }
    },
    
    {
        "pk": 6,
        "model": "team.Basketball",
        "fields": {
            "name": "Paige, Marcus",
            "first": "Marcus Paige",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/UN/UNRNDTAWVSSJBXG.20120829180406.jpg",
            "twitter": "marcuspaige5",
            "number": "5",
            "position": "Guard",
            "height": "6-.5",
            "weight": "157",
            "year": "Freshman",
            "hometown": "Marion, Iowa",
            "school": "Linn-Mar",
            "major": "Undeclared",
            "about": "Should compete for playing time at point guard with the departure of the record-setting Kendall Marshall to the NBA. Should combine with senior Dexter Strickland to play most of the point guard minutes for Carolina in 2012-13. Is left-handed.",
            "personal":" Marcus Taylor Paige is the son of Ellis & Sherryl Paige. His sister plays basketball at the University of Wisconsin. Born on Sept. 11, 1993, in Cedar Rapids, Iowa. Has yet to declare a major. ",
            "youtube": "Z3tIRI50g04"
            
        }
    },
    
    {
        "pk": 7,
        "model": "team.Basketball",
        "fields": {
            "name": "Johnson, Brice",
            "first": "Brice Johnson",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/BZ/BZJVKCYIJSWFEHC.20120829180406.jpg",
            "twitter": "bjohnson_23",
            "number": "11",
            "position": "Forward",
            "height": "6-9",
            "weight": "187",
            "year": "Freshman",
            "hometown": "Orangeburg, S.C.",
            "school": "Edisto",
            "major": "Undeclared",
            "about": "Won Gatorade South Carolina Boys Basketball Player of the Year honors as a junior and senior. Parade All-America. Averaged 25.4 points, 14.3 rebounds, 8.3 blocks and three assists per game as a senior. Led Edisto to a 15-5 record and the second round of the Class 2-A Tournament. Averaged 23 points, 15 rebounds and five blocks in 2011. Played for his dad at Edisto High School in Cordova, S.C. Played in the Jordan Brand Classic. Two-time state champion in the high jump. Also played one year as a wide receiver. Member of the National Honor Society and Fellowship of Christian Athletes.",
            "personal":"Born Jonathan Brice Johnson on June 27, 1994, in Orangeburg, S.C. Son of Herman and Renee Johnson. Has yet to declare a major. ",
            "youtube": "lDtuTu9EM54"
            
        }
    },
    
    {
        "pk": 8,
        "model": "team.Basketball",
        "fields": {
            "name": "Hubert, Desmond",
            "first": "Desmond Hubert",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/XM/XMDFRPSKACTQOKE.20120829180405.jpg",
            "twitter" : "D_Hubert14",
            "number": "14",
            "position": "Forward",
            "height": "6-9.5",
            "weight": "220",
            "year": "Sophomore",
            "hometown": "Cream Ridge, N.J.",
            "school": "New Egypt",
            "major": "Undeclared",
            "about": "Played for Coach Jay Corby at New Egypt High School in New Jersey. Averaged 16 points, nine rebounds and six blocks per game. Led New Egypt a school-record 24 wins and a berth in the Central Jersey Group 1 Section championship game. Team captain. Played in the Capital Classic all-star game. Moved to Cream Ridge, N. J. from Winter Park, Fla. in 2006. Averaged 16.2 points, 10.8 rebounds and 9.1 blocks as a junior. Totaled over 1,500 points, 1,000 rebounds and 750 blocks in his career. ",
            "personal":" Desmond Jackson Hubert was born July 15, 1992, in Willingboro, N.J. Has yet to declare a major.",
            "youtube": "PqOqCGEcGds"
            
        }
    },
    
    {
        "pk": 9,
        "model": "team.Basketball",
        "fields": {
            "name": "Hairston, P.J.",
            "first": "P.J. Hairston",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/RM/RMMSLCKRRQGODUZ.20120829180405.jpg",
            "twitter": "Mr_Hairston15",
            "number": "15",
            "position": "Guard",
            "height": "6-5.5",
            "weight": "220",
            "year": "Sophomore",
            "hometown": "Greensboro, N.C.",
            "school": "Hargrave Military Academy (Va.)/Dudley",
            "major": "Undeclared",
            "about": "Sophomore wing hopes to improve on an inconsistent freshman campaign. Hit 14 of 29 three-point field goal attempts (.483) in the first six games of 2011-12, then hit a slump that saw him end the year shooting .308 from behind the arc. Rebounded late with a strong performance in the ACC Tournament.",
            "personal":"Samuel Peterson Hairston Jr. is the son of Wendy Mailey and William Turner. Born on Dec. 24, 1992, in Greensboro. Has yet to declare a major.",
            "youtube": "ceDK83uaqVQ"
            
        }
    },
    
    {
        "pk": 10,
        "model": "team.Basketball",
        "fields": {
            "name": "Simmons, Jackson",
            "first": "Jackson Simmons",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/ZJ/ZJVDJDHRWAAAWCT.20120829180406.jpg",
            "twitter": "jsimms_21",
            "number": "21",
            "position": "Forward",
            "height": "6-7",
            "weight": "220",
            "year": "Sophomore",
            "hometown": "Webster, N.C.",
            "school": "Smoky Mountain",
            "major": "Undeclared",
            "about": "The Western North Carolina Player of the Year in 2011 by the Asheville Citizen-Times. Associated Press all-state selection in 2011. Played for Coach Jimmy Cleaveland. Set the North Carolina high school record for career rebounds with 1,554 and was the leading scorer in Smoky Mountain High School history with 1,916 points. Averaged 25.4 points and 16.9 rebounds per game as a senior. Two-year team captain. Led Smoky Mountain to a 26-1 record and conference title. Shot 89 percent from the free throw line. Earned MVP honors with 19 points and 15 rebounds in the North Carolina East-West All-Star Game. Also played in the Jordan Brand Classic in Charlotte. Averaged 19.9 points and 12.5 rebounds as a junior. ",
            "personal":"Son of Si and Cindi Simmons, both of whom teach at Smoky Mountain High. Both parents played basketball at Western Carolina University and Cindi is a member of the WCU Athletic Hall of Fame. Cindi also is a four-time state championship coach in both volleyball and basketball. Jackson had a grade point average of 4.2 and was a member of the National Honor Society. A member of the show choir that won three national championships. Took part in the school play in 2010-11. Has yet to declare a major.",
            "youtube": "Q3tV6WYiwJg"
            
        }
    },
    
    {
        "pk": 11,
        "model": "team.Basketball",
        "fields": {
            "name": "Tanner, Frank",
            "first": "Frank Tanner",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/HY/HYQGQZXWGNSKBBI.20121030160827.jpg",
            "twitter": "UNC_Basketball",
            "number": "22",
            "position": "Forward",
            "height": "6-4",
            "weight": "210",
            "year": "Senior",
            "hometown": "Charlotte, N.C.",
            "school": "Hickory Ridge",
            "major": "Business",
            "about": "A walk-on who joined the varsity team in October 2012. A two-year veteran of the UNC junior varsity program. Played JV ball as a freshman and sophomore. Led the JV squad in scoring as a sophomore in 2010-11 at 14 points per game.",
            "personal":"Frank James Tanner is the son of J. & Janice Tanner. Is the younger brother of former Tar Heel walk-on J.B. Tanner, who played two seasons of varsity ball and won an NCAA championship with the 2009 team. J.B. Tanner is now the director of basketball operations at UNC Greensboro under former Tar Heel and UNCG head coach Wes Miller. Born on September 22, 1990, in Oklahoma City, Okla. Majoring in business administration with a concentration in finance. ",
            "youtube": "gc7LeoETNH0"
            
        }
    },
    
    {
        "pk": 12,
        "model": "team.Basketball",
        "fields": {
            "name": "Tokoto, J.P.",
            "first": "J.P. Tokoto",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/WO/WOUYKMLWAZVLUGG.20120829180406.jpg",
            "twitter": "AirPierreTokoto",
            "number": "25",
            "position": "Forward",
            "height": "6-5",
            "weight": "185",
            "year": "Freshman",
            "hometown": "Menomonee Falls, Wisc.",
            "school": "Menomonee Falls",
            "major": "Undeclared",
            "about": "Played for coach Dan Leffel at Menomonee Falls High School. Three-time first-team all-state selection. Two-time team captain. Averaged 24.6 points, 11.5 rebounds, 3.5 assists and 2.6 steals as a senior. Set a dozen school records, including career scoring (mark that had been held for the previous 19 seasons), rebounding and steals. Career stats included 1,737 points and 1,014 rebounds. Set the school's single-game record with 48 points against Catholic Memorial. Averaged 21.2 points, 13.2 rebounds, 3.2 steals and 2.1 assists as a junior and earned Greater Metro Conference Player of the Year honors. Won the 2012 American Family Insurance Slam Dunk contest in New Orleans.",
            "personal":" Born Jean-Pierre Tokoto on September 15, 1993, in Rockford, Ill. His parents are Trevor and Laurence Trimble. Played soccer until age 13, when he first began to play basketball. His grandfather, J.P. Tokoto, played for the Cameroon national soccer team. Undeclared major. ",
            "youtube": "uRbEBGl0W9c"
            
        }
    },
    
    {
        "pk": 13,
        "model": "team.Basketball",
        "fields": {
            "name": "Manor, James",
            "first": "James Manor",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/ES/ESUDLCOGIZHPAPH.20121030160827.jpg",
            "twitter": "JamesManor",
            "number": "30",
            "position": "Forward",
            "height": "6-6",
            "weight": "210",
            "year": "Junior",
            "hometown": "Carrboro, N.C.",
            "school": "Chapel Hill",
            "major": "Business",
            "about": "A walk-on who joined the varsity team in October 2012. A two-year veteran of the UNC junior varsity program. Played JV ball as a freshman and sophomore. Played four years of varsity basketball at Chapel Hill High School as a power forward. Named all-conference for the Carolina 6 Conference and all-district for district 6 as a senior. Also played two years of varsity lacrosse. Team captain of the basketball squad. Member of the National Honor Society.",
            "personal":" James William Manor is the son of Jim and Linda Manor. Born on January 6, 1992, in Carrboro, N.C. Majoring in business administration.",
            "youtube": "gc7LeoETNH0"
            
        }
    },
    
    {
        "pk": 14,
        "model": "team.Basketball",
        "fields": {
            "name": "Robinson, Denzel",
            "first": "Denzel Robinson",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/EG/EGIVRIMMHQNYZUC.20121030160827.jpg",
            "twitter": "UNC_Basketball",
            "number": "34",
            "position": "Forward",
            "height": "6-4",
            "weight": "215",
            "year": "Junior",
            "hometown": "Chapel Hill, N.C.",
            "school": "Chapel Hill",
            "major": "Communication Studies",
            "about": "A walk-on who joined the varsity team in October 2012. A two-year veteran of the UNC junior varsity program. Played JV ball as a freshman and sophomore. Played four years of varsity basketball at Chapel Hill High School for Paul Kieckbusch and Tod Morgan. Averaged 10.4 points, 6.8 rebounds and 2.3 assists per game as a senior. Two-time all-conference choice. Named third-team all-district as a junior. An academic all-conference selection.",
            "personal":"Denzel Amir Robinson is the son of Steve and Lisa Robinson. His father is a longtime assistant to Roy Williams and former head coach at Tulsa and Florida State. His older brother played baseball at UNC and Brevard College. His younger sister plays volleyball and competes in Track and Field at Lenoir-Rhyne University. Born on March 20, 1991, in Lawrence, Kan. Majoring in Communication Studies.",
            "youtube": "0CkP8xxeG3c"
            
        }
    },
    
    {
        "pk": 15,
        "model": "team.Basketball",
        "fields": {
            "name": "Bullock, Reggie",
            "first": "Reggie Bullock",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/WN/WNGAFGRVTXTXAMH.20120829180405.jpg",
            "twitter": "DaBully35",
            "number": "35",
            "position": "Guard",
            "height": "6-7",
            "weight": "205",
            "year": "Junior",
            "hometown": "Kinston, N.C.",
            "school": "Kinston",
            "major": "Communication Studies",
            "about": "Carolina's leading returning scorer for 2012-13. Averaged 8.8 points per game last season. Led the Tar Heels in three-pointers. Named MVP of the 2012 N.C. Pro-Am summer league championship game after scoring 28 points in the title contest.",
            "personal":"Reginald Ryedell Bullock is the son of Danielle Long. Born March 16, 1991, in Baltimore, Md. Majoring in communication studies. Last name is pronounced BULL-lock.",
            "youtube": "aOs8kOcjln8"
            
        }
    },
    
    {
        "pk": 16,
        "model": "team.Basketball",
        "fields": {
            "name": "McAdoo, James Michael",
            "first": "James Michael McAdoo",
            "image": "http://image.cdnllnwnl.xosnetwork.com/pics32/400/ID/IDEJCORHUUOOGID.20120829180406.jpg",
            "twitter": "macCANdoo",
            "number": "43",
            "position": "Forward",
            "height": "6-9",
            "weight": "230",
            "year": "Sophomore",
            "hometown": "Norfolk, V.A.",
            "school": "Norfolk Christian",
            "major": "Undeclared",
            "about": "Carolina's top big man off the bench a season ago. Should become a key player, building off the late-season success and production he showed as a freshman. One of the top-rated power forwards in college basketball.",
            "personal":" Born James Michael Ray McAdoo on Jan. 4, 1993, in Norfolk. Son of Ronnie and Janet McAdoo. Both parents played professional basketball overseas. His father is a member of Old Dominion University's Hall of Fame and played professionally in France, Spain and Japan. His sister played basketball at UNC Charlotte. Ronnie McAdoo is a second cousin of former Tar Heel All-America and Naismith Hall of Famer Bob McAdoo. Has yet to declare a major.",
            "youtube": "kZU4VyWAsn8"
            
        }
    }
]